/*

**************************************
11127 各位数字
**************************************
Description

从键盘输入一个3位数的正整数，要求先后输出该数的百位数字与个位数字，各占一行
**************************************
Input

一个三位整数
**************************************
Output

输出该数的百位数字与个位数字
**************************************
Sample Input

123
**************************************
Sample Output

1

3


**************************************
Author0*/
#include "stdio.h"
main(){
	int a;
	scanf("%d",&a);
	printf("%d\n%d",(a-(a%100))/100,a%10);
}
