/*

**************************************
18049 迭代法求平方根
**************************************
Description

使用迭代法求a的平方根。求平方根的迭代公式如下，要求计算到相邻两次求出的x的差的绝对值小于1E-5时停止，结果显示4位小数
**************************************
Input

输入一个非负实数a
**************************************
Output

计算并输出平方根
**************************************
Sample Input

16
**************************************
Sample Output

4.0000
**************************************
Author0*/
#include "stdio.h"
#include <math.h>
int main(int argc, char const *argv[])
{
	double a,xn=1,xn1;
	scanf("%lf",&a);

	while(fabs(xn-xn1)>=1e-5){
		xn1=xn;
		xn=0.5*(xn+a/xn);

	}

	printf("%.4lf",xn);

	return 0;
}