/*

**************************************
1007 判断平方数
**************************************
Description由键盘输入一个正整数，判断该数是否为平方数，是输出Y，否则输出N
**************************************
Input一个整数
**************************************
OutputY或者N
**************************************
Sample Input49


**************************************
Sample OutputY


**************************************
Hint
**************************************
Author0*/
#include "stdio.h"
#include <math.h>
int main(int argc, char const *argv[])
{
	double a;/* don't use this !!! :)*/
	scanf("%lf",&a);
	printf("%s",sqrt(a)*sqrt(a)==a?"Y":"N");
	return 0;
}