/*

**************************************
18054 输出不同的数
**************************************
Description

输入10个整数，输出其中不同的数，即如果一个数出现了多次，只输出一次。
**************************************
Input

输入10个整数
**************************************
Output

依次输出不同的数字（一行一个，从上到下依次输出先出现的数）
**************************************
Sample Input

1 2 1 3 3 2 4 5 5 9


**************************************
Sample Output

1

2

3

4

5

9


**************************************
Author0*/
#include "stdio.h"

int main(int argc, char const *argv[])
{
	int num=0,nums[10],fail;		
	for (int i = 0; i < 10; ++i)
	{
		fail=0;
		scanf("%d",&num);
		nums[i]=num;

		for (int k = 0; k < i; ++k)
		{
			if(nums[k]==num){
				fail=1;
			}
		}

		if(fail==0){
			printf("%d\n",num);
		}
	}
	return 0;
}