/*

**************************************
18056 字母统计
**************************************
Description

输入三行字符串（每行以换行回车为结束符），每行不超过80个字符。统计并输出其有多少个大写字母。
**************************************
Input

三行字符串
**************************************
Output

大写字母个数
**************************************
Sample Input

A-1 123

ABC abc

G


**************************************
Sample Output

5


**************************************
Author0*/
#include "stdio.h"
int main(int argc, char const *argv[])
{
	char ch;
	int count=0,cn=0;
	while(cn<3){
		ch=getchar();
		if(ch>='A'&&ch<='Z'){
			count++;
		}

		if(ch=='\n'){
			cn++;
		}
	}

	printf("%d",count);
	return 0;
}