/*

**************************************
1003 二进制数中1的个数
**************************************
Description由键盘给定一个正整数N，编程实现求该整数对应的二进制数中1的个数。
**************************************
Input正整数N
**************************************
Output二进制数中1的个数
**************************************
Sample Input14


**************************************
Sample Output3


**************************************
Hint
**************************************
Author0*/
#include <stdio.h>
int main(){
	long input;
	scanf("%d",&input);
	int s=1;
	int count=0;
	for (int i=0;i<32;i++){
		if(input & s){
			count++;
		}

		s<<=1;
	}

	printf("%d",count);
	return 0;
}