/*

**************************************
1151 求函数值
**************************************
Description

函数定义如下：

F(x)=x          	         x小于3

F(x)=F(x/3)*2   	         x大于等于3且x为3的倍数

F(x)=F((x-1)/3)+1   	x大于等于3且x除3余1

F(x)=F((x-2)/3)+2   	x大于等于3且x除3余2


**************************************
Input
一个整数
**************************************
Output
结果
**************************************
Sample Input

20
**************************************
Sample Output

6
**************************************
Author0*/
#include <stdio.h>
int F(int x){

	if(x<3){
		return x;
	}else{
		if (x%3==0){
			return F(x/3)*2;
		}

		if(x%3==1){
			return F((x-1)/3)+1;
		}

		if(x%3==2){
			return F((x-2)/3)+2;
		}
	}
}
int main(int argc, char const *argv[])
{
	int a;
	scanf("%d",&a);

	printf("%d",F(a));
	return 0;
}