/*

**************************************
18047 水仙花数
**************************************
Description

输出所有的水仙花数。所谓水仙花数是一个3位的正整数，其各位数字的立方和等于这个数本身。

例如，153是水仙花数，因为1^3+5^3+3^3=153。 ^代表上标


**************************************
Input

无
**************************************
Output

一行一个，由小到大输出所有水仙花数
**************************************
Sample Input

无
**************************************
Sample Output

略
**************************************
Author0*/
#include "stdio.h"
int main(int argc, char const *argv[])
{
	int num[3]={0};
	//printf("153\n370\n371\n407") 23333333333333333
	for (num[0]=0;num[0]<=9;num[0]++){
		for (num[1]=0;num[1]<=9;num[1]++){
			for (num[2]=0;num[2]<=9;num[2]++){
				if(num[0]*num[0]*num[0]+num[1]*num[1]*num[1]+num[2]*num[2]*num[2]==num[0]*100+num[1]*10+num[2] && num[0]*100+num[1]*10+num[2] >=100){
					printf("%d%d%d\n",num[0],num[1],num[2]);
				}
			}
		}
	}
	return 0;
}