/*

**************************************
18060 删除空格
**************************************
Description

用指针方法解决，输入一个字符串，删除字符串中所有空格后，输出字符串
**************************************
Input

一行字符，以换行回车结束，最多不超过80个字符
**************************************
Output

删除所有空格后输出
**************************************
Sample Input

abc    456
**************************************
Sample Output

abc456
**************************************
Author0*/
#include <stdio.h>

void removeSpace(char *s)
{
    char cache[81]="";
    int i=0,k=0;
    while(s[i]!='\0'){
        if(s[i]!=' '){
            cache[k]=s[i];
            k++;
        }
        i++;
    }
    for(i=0;i<81;i++){
        s[i]=cache[i];
    }
    s[80]='\0';
}

int main()
{
    char s[81];
    gets(s);
    removeSpace(s);
    printf("%s", s);
    return 0;
}
