/*

**************************************
1015 计算摄氏温度值
**************************************
Description
从键盘输入一个华氏温度值，要求按格式输出其对应的摄氏温度值，精确到小数点后两位。

数学公式描述为：



摄氏温度值等于9分之5  乘上  华氏温度值减去32的差 所得到的积。




**************************************
Input
华氏温度值
**************************************
Output
摄氏温度值，精确到小数点后两位
**************************************
Sample Input
100
**************************************
Sample Output
37.78
**************************************
Author0*/
#include "stdio.h"
main(){
	float a;
	scanf("%f",&a);
	printf("%.2f",(float) (a-32)*5/9);
}
