/*

**************************************
18065 所有数字之和
**************************************
Description

编写一个函数，计算一个整数的所有数字之和
**************************************
Input

由键盘输入一个整数
**************************************
Output

输出该数各位数字之和
**************************************
Sample Input

123


**************************************
Sample Output

6


**************************************
Hint

1+2+3=6
**************************************
Author0*/
#include "stdio.h"

int sum(int n)
{   int re=0,a,i=1,b;
    while(n!=0){
        a=n%10;
        n=(n-a)/10;
        re+=a;
        //printf("%d\n",n);
    }
    return re;
}

main()
{
    int n;
    scanf("%d", &n);
    printf("%d", sum(n));
}
