/*

**************************************
1047 冒泡排序
**************************************
Description
由键盘输入10个数，用“冒泡法”对10个数从小到大排序，并按格式要求输出。代码如下，请填充完整。


**************************************
Sample Input
70 5 14 20 19 2 99 67 13 66
**************************************
Sample Output
2 5 13 14 19 20 66 67 70 99
**************************************
Author0*/
#include "stdio.h" 
main() 
{  int a[10], i, j, t; 
   for(i=0;i<10;i++) 
      scanf("%d",a+i) ;     
   for(i=0;i<10;i++) 
   {     for(j=0;j<i;j++) 
         if (a[i]<a[j]) 
            {t=a[i];a[i]=a[j];a[j]=t;} 
   } 
   for(i=0;i<10;i++) 
      printf("%d ",a[i]); 
} 

