/*

**************************************
1016 字符变换
**************************************
Description
由键盘输入5个字符，将其中的大写字符变成小写（其它类型的字符不变），最后，按输入顺序输出这5个字符。
**************************************
Sample Input
ApPLe
**************************************
Sample Output
apple
**************************************
Author0*/
#include "stdio.h"
main(){
    char str[6];
    scanf("%s",str);
    int i;
    for(i=0;i<6;i++)
        if(str[i]<123&&str[i]>64)
        	str[i]=str[i]<91?str[i]+32:str[i];
    str[5]='\0';
    printf("%s",str);
}
