/*

**************************************
18043 找出3个数中最大的数
**************************************
Description

编写程序，由键盘输入3个整数，输出其中最大的数。
**************************************
Input

三个整数，空格分隔
**************************************
Output

最大的数
**************************************
Sample Input

3 6 4
**************************************
Sample Output

6
**************************************
Author0*/
// like uoj1018 :)

#include "stdio.h"
main(){
	int data[3];
    int i,j,temp;
	scanf("%d%d%d",&data[0],&data[1],&data[2]);
	for( i=0;i<3;i++){
        for ( j=0;j<i;j++){
            if(data[i]>data[j]){
                temp=data[i];
                data[i]=data[j];
                data[j]=temp;
            }
        }

    }

    printf("%d",data[0]);
}

