/*

**************************************
1039 倒序
**************************************
Description
由键盘输入10个整数，倒序输出。
**************************************
Sample Input

70

5

14

20

19

2

99

67

13

66


**************************************
Sample Output

66

13

67

99

2

19

20

14

5

70


**************************************
Author0*/
#include "stdio.h"
int main(int argc, char const *argv[])
{
	int data[10];

	for (int i = 0; i < 10; ++i)
	{
		scanf("%d",data+i);
	}

	for (int i = 0; i < 10; ++i)
	{
		printf("%d\n",data[10-i-1]);
	}
	return 0;


}