/*

**************************************
1014 求圆面积
**************************************
Description

由键盘输入圆半径r，请计算并输出该圆的面积。（注：π取3.14159，结果采用浮点数表示，且要求仅显示两位小数位）


**************************************
Input

一个实数
**************************************
Output

输出以该实数为半径的圆面积
**************************************
Sample Input

65.2
**************************************
Sample Output

13355.02
**************************************
Author0*/
#include "stdio.h"
main(){
	float a;
	scanf("%f",&a);
	printf("%.2f",(float) 3.14159*a*a);
}
