/*

**************************************
18037 20秒后的时间
**************************************
Description

编写程序，输入三个整数变量hour（小时）、minute（分钟）、second（秒）代表一个时间，

输出该时间20秒以后的时间。
**************************************
Input

一行三个整数，分别代表小时、分钟、秒，中间使用冒号分隔


**************************************
Output

输出一个时间，数字间用冒号分隔

小时、分钟、秒均占两个数字位，不足位用0补足
**************************************
Sample Input

15:30:41


**************************************
Sample Output

15:31:01
**************************************
Author0*/
#include "stdio.h"

int main(int argc, char const *argv[])
{
	int h,m,s;
	scanf("%d:%d:%d",&h,&m,&s);
	s=s+20;
	if(s>59){
		s-=60;
		m++;
	}
	if(m>59){
		m-=60;
		h++;
	}
	if(h>23){
		h=0;
	}

	printf("%02d:%02d:%02d",h,m,s);
	return 0;
}