/*

**************************************
1059 [填空题]函数定义
**************************************
Description
下面是使用辗转相除法，求最大公约数的程序，请补充完整程序中函数的定义与调用，运行通过后提交代码。
**************************************
Sample Input
24 16
**************************************
Sample Output
8
**************************************
Author0*/
#include  "stdio.h" 

int test1(int m,int n)
{ 
    int  r; 
    while ((r=m%n)!=0) 
    { 
        m=n; 
        n=r; 
    } 
    return  n; 
} 

main() 
{ 
    int  a, b, n; 
    scanf("%d%d", &a, &b); 
    printf("%d\n", test1(a,b)); 
} 