/*

**************************************
1120 判断点是否在圆上
**************************************
Description

由键盘输入一个点的坐标, 要求编程判断这个点是否在单位圆(圆心在坐标0,0)上，点在圆上输出Y, 不在圆上输出N。

使用小数点后3位精度进行判断。
**************************************
Sample Input

0.707,0.707
**************************************
Sample Output

Y
**************************************
Author0*/
#include "stdio.h"

int main(int argc, char const *argv[])
{
	double x,y;

	scanf("%lf,%lf",&x,&y);

	if(0.999<x*x+y*y&&x*x+y*y<1.001){printf("Y");}else{printf("N");}
	return 0;
}