/*

**************************************
1044 输出最小值
**************************************
Description
从键盘输入十个整数，输出最小值
**************************************
Input
输入的整数绝对值不会超过10000
**************************************
Output
按样例格式输出结果
**************************************
Sample Input
12  45  76  87  5  87  43  55  99  21
**************************************
Sample Output
5
**************************************
Author0*/
#include "stdio.h"

int main(int argc, char const *argv[])
{
	int data[10],min;
	for (int i = 0; i < 10; ++i)
		scanf("%d",data+i);
	min=data[0];
	for (int i = 0; i < 10; ++i)
		if(data[i]<min){min=data[i];}
	printf("%d",min);
	return 0;
}


	