/*

**************************************
18051 勾股数
**************************************
Description

若三个正整数a、b、c，其中a<=b<=c，满足a^2+b^2=c^2，其中^表示上标，称这三个数为“勾股数”，例如：3、4、5是勾股数。编程输出不大于n的所有勾股数。
**************************************
Input

输入一个数(n<=100)
**************************************
Output

输出所有勾股数，按第1个数字由小到大排列（若第1个数字相同，按第2个数字排）
**************************************
Sample Input

5


**************************************
Sample Output

3 4 5


**************************************
Author0*/
#include "stdio.h"
int main(int argc, char const *argv[])
{
	int a,b,c,n;
	scanf("%d",&n);
	for (a=1;a<=n;a++){
		for (int b = a; b < n+1; ++b)
		{
			for (int c = b; c < n+1; ++c)
			{
				if(a*a+b*b == c*c){
					printf("%d %d %d\n",a,b,c);
				}
			}
		}
	}
	
	return 0;
}