/*

**************************************
1040 统计不同数字的个数
**************************************
Description
由键盘输入20个整数，统计不同数字的个数。
**************************************
Sample Input
70  5  14  22  19  2  99  67  13  66  5  93  44  38  22  11  39  22  33  11
**************************************
Sample Output
16
**************************************
Hint
因为5有1个重复数字，11有1个重复数字，22有2个重复数字
**************************************
Author0*/
#include "stdio.h" 
main() 
{  int a[20], i, j, t,count=0; 
   for(i=0;i<20;i++) 
      scanf("%d",a+i) ;     
   for(i=0;i<20;i++) 
   {     for(j=0;j<i;j++) 
         if (a[i]<a[j]) 
            {t=a[i];a[i]=a[j];a[j]=t;} 
   } 
   if(a[0]==a[1]) count++;
   for(i=0;i<20;i++) 
      if(a[i-1]!=a[i]) 
      	count ++;
   printf("%d",count);
} 