/*

**************************************
18041 分期还款(加强版)
**************************************
Description

从银行贷款金额为d，准备每月还款额为p，月利率为r。请编写程序输入这三个数值，计算并输出多少个月能够还清贷款，输出时保留1位小数。

如果无法还清，请输出“God”

计算公式如下：


**************************************
Input

三个数，分别为货款金额、每月还款和月利率，以空格分隔，均为非负数，其中d，p，r>=0
**************************************
Output

需要还款的月份
**************************************
Sample Input

50 50 0.01


**************************************
Sample Output

1.0
**************************************
Author0*/
#include <stdio.h>
#include <math.h> 
int main() {      
	double d, p,r;     
	scanf("%lf%lf%lf",&d,&p,&r);     
	if(d==0){    
		printf("0.0\n"); 
		return 0;
	}

	if(d*(1+r)-p>d||p-d*r<0||p/(p-d*r)<1)         
		printf("God\n");     
	else {          
		printf("%.1f", log10(p/(p-d*r))/log10(1+r));     
	}     
	return 0;
}