/*

**************************************
1019 数的整除
**************************************
Description
由键盘输入5个整数，逐个判断它们能否被27整除，能的输出“YES”，不能的输出“NO”（注意，输出时，一个判断结果占一行，5个数的判断共占5行）。
**************************************
Input
用空格分隔
**************************************
Output
一行一个判断
**************************************
Sample Input
8  27  17577  325  54
**************************************
Sample Output

NO

YES

YES

NO

YES


**************************************
Author0*/
#include <stdio.h>

int main(int argc, char const *argv[])
{
	int nums[5]={0};
	int i=0;
	for (int i = 0; i < 5; ++i)
		scanf("%d",&nums[i]);
	for (int i = 0; i < 5; ++i)
		printf("%s",nums[i]%27?"NO\n":"YES\n");
	return 0;
}